PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_sgpio.h
#define LPC43_SGPIO_PRESET_OFFSET(n)       (0x0140 + ((n) << 2)
#define LPC43_SGPIO_PRESET0_OFFSET         0x0140 /* COUNT0 reload value */
#define LPC43_SGPIO_PRESET1_OFFSET         0x0144 /* COUNT1 reload value */
#define LPC43_SGPIO_PRESET2_OFFSET         0x0148 /* COUNT2 reload value */
#define LPC43_SGPIO_PRESET3_OFFSET         0x014c /* COUNT3 reload value */
#define LPC43_SGPIO_PRESET4_OFFSET         0x0150 /* COUNT4 reload value */
#define LPC43_SGPIO_PRESET5_OFFSET         0x0154 /* COUNT5 reload value */
#define LPC43_SGPIO_PRESET6_OFFSET         0x0158 /* COUNT6 reload value */
#define LPC43_SGPIO_PRESET7_OFFSET         0x015c /* COUNT7 reload value */
#define LPC43_SGPIO_PRESET8_OFFSET         0x0160 /* COUNT8 reload value */
#define LPC43_SGPIO_PRESET9_OFFSET         0x0164 /* COUNT9 reload value */
#define LPC43_SGPIO_PRESET10_OFFSET        0x0168 /* COUNT10 reload value */
#define LPC43_SGPIO_PRESET11_OFFSET        0x016c /* COUNT11 reload value */
#define LPC43_SGPIO_PRESET12_OFFSET        0x0170 /* COUNT12 reload value */
#define LPC43_SGPIO_PRESET13_OFFSET        0x0174 /* COUNT13 reload value */
#define LPC43_SGPIO_PRESET14_OFFSET        0x0178 /* COUNT14 reload value */
#define LPC43_SGPIO_PRESET15_OFFSET        0x017c /* COUNT15 reload value */

#define LPC43_SGPIO_COUNT_OFFSET(n)        (0x0180 + ((n) << 2)
#define LPC43_SGPIO_COUNT0_OFFSET          0x0180 /* Down counter 0 */
#define LPC43_SGPIO_COUNT1_OFFSET          0x0184 /* Down counter 1 */
#define LPC43_SGPIO_COUNT2_OFFSET          0x0188 /* Down counter 2 */
#define LPC43_SGPIO_COUNT3_OFFSET          0x018c /* Down counter 3 */
#define LPC43_SGPIO_COUNT4_OFFSET          0x0190 /* Down counter 4 */
#define LPC43_SGPIO_COUNT5_OFFSET          0x0194 /* Down counter 5 */
#define LPC43_SGPIO_COUNT6_OFFSET          0x0198 /* Down counter 6 */
#define LPC43_SGPIO_COUNT7_OFFSET          0x019c /* Down counter 7 */
#define LPC43_SGPIO_COUNT8_OFFSET          0x01a0 /* Down counter 8 */
#define LPC43_SGPIO_COUNT9_OFFSET          0x01a4 /* Down counter 9 */
#define LPC43_SGPIO_COUNT10_OFFSET         0x01a8 /* Down counter 10 */
#define LPC43_SGPIO_COUNT11_OFFSET         0x01ac /* Down counter 11 */
#define LPC43_SGPIO_COUNT12_OFFSET         0x01b0 /* Down counter 12 */
#define LPC43_SGPIO_COUNT13_OFFSET         0x01b4 /* Down counter 13 */
#define LPC43_SGPIO_COUNT14_OFFSET         0x01b8 /* Down counter 14 */
#define LPC43_SGPIO_COUNT15_OFFSET         0x01bc /* Down counter 15 */

#define LPC43_SGPIO_POS_OFFSET(n)          (0x01c0 + ((n) << 2)
#define LPC43_SGPIO_POS0_OFFSET            0x01c0 /* Position register 0 */
#define LPC43_SGPIO_POS1_OFFSET            0x01c4 /* Position register 1 */
#define LPC43_SGPIO_POS2_OFFSET            0x01c8 /* Position register 2 */
#define LPC43_SGPIO_POS3_OFFSET            0x01cc /* Position register 3 */
#define LPC43_SGPIO_POS4_OFFSET            0x01d0 /* Position register 4 */
#define LPC43_SGPIO_POS5_OFFSET            0x01d4 /* Position register 5 */
#define LPC43_SGPIO_POS6_OFFSET            0x01d8 /* Position register 6 */
#define LPC43_SGPIO_POS7_OFFSET            0x01dc /* Position register 7 */
#define LPC43_SGPIO_POS8_OFFSET            0x01e0 /* Position register 8 */
#define LPC43_SGPIO_POS9_OFFSET            0x01e4 /* Position register 9 */
#define LPC43_SGPIO_POS10_OFFSET           0x01e8 /* Position register 0 */
#define LPC43_SGPIO_POS11_OFFSET           0x01ec /* Position register 1 */
#define LPC43_SGPIO_POS12_OFFSET           0x01f0 /* Position register 2 */
#define LPC43_SGPIO_POS13_OFFSET           0x01f4 /* Position register 3 */
#define LPC43_SGPIO_POS14_OFFSET           0x01f8 /* Position register 4 */
#define LPC43_SGPIO_POS15_OFFSET           0x01fc /* Position register 5 */

#define LPC43_SGPIO_MASKA_OFFSET           0x0200 /* Mask for pattern match function of slice A */
#define LPC43_SGPIO_MASKH_OFFSET           0x0204 /* Mask for pattern match function of slice H */
#define LPC43_SGPIO_MASKI_OFFSET           0x0208 /* Mask for pattern match function of slice I */
#define LPC43_SGPIO_MASKP_OFFSET           0x020c /* Mask for pattern match function of slice P */
#define LPC43_SGPIO_GPIO_INREG_OFFSET      0x0210 /* GPIO input status register */
#define LPC43_SGPIO_GPIO_OUTREG_OFFSET     0x0214 /* GPIO output control register */
#define LPC43_SGPIO_GPIO_OENREG_OFFSET     0x0218 /* GPIO OE control register */
#define LPC43_SGPIO_CTRL_ENABLE_OFFSET     0x021c /* Enables the slice COUNT counter */
#define LPC43_SGPIO_CTRL_DISABLE_OFFSET    0x0220 /* Disables the slice POS counter */

#define LPC43_SGPIO_INT_OFFSET(n)          (0xf00 + ((n) << 5))
#define LPC43_SGPIO_CLREN_INTOFFSET        0x0000 /* Interrupt clear mask */
#define LPC43_SGPIO_SETEN_INTOFFSET        0x0004 /* Interrupt set mask */
#define LPC43_SGPIO_ENABLE_INTOFFSET       0x0008 /* Interrupt enable */
#define LPC43_SGPIO_STATUS_INTOFFSET       0x000c /* Interrupt status */
#define LPC43_SGPIO_CLRSTAT_INTOFFSET      0x0010 /* Interrupt clear status */
#define LPC43_SGPIO_SETSTAT_INTOFFSET      0x0014 /* Interrupt set status */

#define LPC43_SGPIO_CLREN_OFFSET(n)        (LPC43_SGPIO_INT_OFFSET(n)+LPC43_SGPIO_CLREN_INTOFFSET)
#define LPC43_SGPIO_SETEN_OFFSET(n)        (LPC43_SGPIO_INT_OFFSET(n)+LPC43_SGPIO_SETEN_INTOFFSET)
#define LPC43_SGPIO_ENABLE_OFFSET(n)       (LPC43_SGPIO_INT_OFFSET(n)+LPC43_SGPIO_ENABLE_INTOFFSET)
#define LPC43_SGPIO_STATUS_OFFSET(n)       (LPC43_SGPIO_INT_OFFSET(n)+LPC43_SGPIO_STATUS_INTOFFSET)
#define LPC43_SGPIO_CLRSTAT_OFFSET(n)      (LPC43_SGPIO_INT_OFFSET(n)+LPC43_SGPIO_CLRSTAT_INTOFFSET)
#define LPC43_SGPIO_SETSTAT_OFFSET(n)      (LPC43_SGPIO_INT_OFFSET(n)+LPC43_SGPIO_SETSTAT_INTOFFSET)

#define LPC43_SGPIO_CLREN0_OFFSET          0x0f00 /* Shift clock interrupt clear mask */
#define LPC43_SGPIO_SETEN0_OFFSET          0x0f04 /* Shift clock interrupt set mask */
#define LPC43_SGPIO_ENABLE0_OFFSET         0x0f08 /* Shift clock interrupt enable */
#define LPC43_SGPIO_STATUS0_OFFSET         0x0f0c /* Shift clock interrupt status */
#define LPC43_SGPIO_CLRSTAT0_OFFSET        0x0f10 /* Shift clock interrupt clear status */
#define LPC43_SGPIO_SETSTAT0_OFFSET        0x0f14 /* Shift clock interrupt set status */

#define LPC43_SGPIO_CLREN1_OFFSET          0x0f20 /* Exchange clock interrupt clear mask */
#define LPC43_SGPIO_SETEN1_OFFSET          0x0f24 /* Exchange clock interrupt set mask */
#define LPC43_SGPIO_ENABLE1_OFFSET         0x0f28 /* Exchange clock interrupt enable */
#define LPC43_SGPIO_STATUS1_OFFSET         0x0f2c /* Exchange clock interrupt status */
#define LPC43_SGPIO_CLRSTAT1_OFFSET        0x0f30 /* Exchange clock interrupt clear status */
#define LPC43_SGPIO_SETSTAT1_OFFSET        0x0f34 /* Exchange clock interrupt set status */

