PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_sgpio.h
/* COUNTn reload value (32-bit data) */

#define SGPIO_PRESET_MASK                  (0xfff)   /* Bits 0-11: Counter reload value */
                                                     /* Bits 12-31: Reserved */
/* Down counter registers */

#define SGPIO_COUNT_MASK                   (0xfff)   /* Bits 0-11: Down counter */
                                                     /* Bits 12-31: Reserved */
/* Position registers */

#define SGPIO_POS_POS_SHIFT                (0)       /* Bits 0-7: Each time COUNT reaches zero POS counts down */
#define SGPIO_POS_POS_MASK                 (0xffff << SGPIO_POS_POS_SHIFT)
#define SGPIO_POS_RESET_SHIFT              (8)       /* Bits 8-15: Reload value for POS after POS reaches zero */
#define SGPIO_POS_RESET_MASK               (0xffff << SGPIO_POS_RESET_SHIFT)
                                                     /* Bits 16-31: Reserved */
/* Mask for pattern match function of slice A (32-bit bit mask) */
/* Mask for pattern match function of slice H (32-bit bit mask) */
/* Mask for pattern match function of slice I (32-bit bit mask) */
/* Mask for pattern match function of slice P (32-bit bit mask) */

/* Common bit mask that can be used in all interrupt registers */

#define SGPIO_SLICE(n)                     (1 << (n)) /* Bits 0-15: Bit n corresponids to slice n */
                                                      /* Bits 16-31: Reserved */
/* GPIO input status register */

#define SGPIO_GPIO_INREG(n)                (1 << (n)) /* Bits 0-15: Bit i reflects the input state of SGPIO pin  */
                                                      /* Bits 16-31: Reserved */
/* GPIO output control register */

#define SGPIO_GPIO_OUTREG(n)               (1 << (n)) /* Bits 0-15: Bit i sets the output of SGPIO pin i */
                                                      /* Bits 16-31: Reserved */
/* GPIO output enable register */

#define SGPIO_GPIO_OENREG(n)               (1 << (n)) /* Bits 0-15: Bit i selects the output enable state of SGPIO pin i */
                                                      /* Bits 16-31: Reserved */
/* Slice count enable register */

#define SGPIO_CTRL_ENABLE(n)               (1 << (n)) /* Bits 0-15: Bit n controls slice n */
                                                      /* Bits 16-31: Reserved */
/* Slice count disable register */

#define SGPIO_CTRL_DISABLE(n)              (1 << (n)) /* Bits 0-15: Bit n controls slice n */
                                                      /* Bits 16-31: Reserved */
/* Shift clock interrupt clear mask */

#define SGPIO_CLREN0(n)                    (1 << (n)) /* Bits 0-15: Bit n shift clock interrupt clear mask of slice n */
                                                      /* Bits 16-31: Reserved */
/* Shift clock interrupt set mask */

#define SGPIO_SETEN0(n)                    (1 << (n)) /* Bits 0-15: Bit n shift clock interrupt clear mask of slice n */
                                                      /* Bits 16-31: Reserved */
/* Shift clock interrupt enable */

#define SGPIO_ENABLE0(n)                   (1 << (n)) /* Bits 0-15: Bit n shift clock interrupt enable of slice n */
                                                      /* Bits 16-31: Reserved */
/* Shift clock interrupt status */

#define SGPIO_STATUS0(n)                   (1 << (n)) /* Bits 0-15: Bit n shift clock interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Shift clock interrupt clear status */

#define SGPIO_CLRSTAT0(n)                  (1 << (n)) /* Bits 0-15: Bit n shift clears interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Shift clock interrupt set status */

#define SGPIO_SETSTAT0(n)                  (1 << (n)) /* Bits 0-15: Bit n shift sets interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Exchange clock interrupt clear mask */

#define SGPIO_CLREN1(n)                    (1 << (n)) /* Bits 0-15: Bit n clears exchange clock interrupt mask of slice n */
                                                      /* Bits 16-31: Reserved */
/* Exchange clock interrupt set mask */

#define SGPIO_SETEN1(n)                    (1 << (n)) /* Bits 0-15: Bit n sets exchange clock interrupt mask of slice n */
                                                      /* Bits 16-31: Reserved */
/* Exchange clock interrupt enable */

#define SGPIO_ENABLE1(n)                   (1 << (n)) /* Bits 0-15: Bit n enables exchange clock interrupt of slice n */
                                                      /* Bits 16-31: Reserved */
/* Exchange clock interrupt status */

#define SGPIO_STATUS1(n)                   (1 << (n)) /* Bits 0-15: Bit n status of exchange clock interrupt of slice n */
                                                      /* Bits 16-31: Reserved */
/* Exchange clock interrupt clear status */

#define SGPIO_CLRSTAT1(n)                  (1 << (n)) /* Bits 0-15: Bit n clears exchange clock interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Exchange clock interrupt set status */

#define SGPIO_SETSTAT1(n)                  (1 << (n)) /* Bits 0-15: Bit n sets exchange clock interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Pattern match interrupt clear mask */

#define SGPIO_CLREN2(n)                    (1 << (n)) /* Bits 0-15: Bit n clears match interrupt mask of slice n */
                                                      /* Bits 16-31: Reserved */
/* Pattern match interrupt set mask */

#define SGPIO_SETEN2(n)                    (1 << (n)) /* Bits 0-15: Bit n sets match interrupt mask of slice n */
                                                      /* Bits 16-31: Reserved */
/* Pattern match interrupt enable */

#define SGPIO_ENABLE2(n)                   (1 << (n)) /* Bits 0-15: Bit n enables match interrupt of slice n */
                                                      /* Bits 16-31: Reserved */
/* Pattern match interrupt status */

#define SGPIO_STATUS2(n)                   (1 << (n)) /* Bits 0-15: Bit n is match interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Pattern match interrupt clear status */

#define SGPIO_CLRSTAT2(n)                  (1 << (n)) /* Bits 0-15: Bit n sets match interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Pattern match interrupt set status */

#define SGPIO_SETSTAT2(n)                  (1 << (n)) /* Bits 0-15: Bit n sets match interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Input interrupt clear mask */

#define SGPIO_CLREN3(n)                    (1 << (n)) /* Bits 0-15: Bit n clears input interrupt mask of slice n */
                                                      /* Bits 16-31: Reserved */
/* Input bit match interrupt set mask */

#define SGPIO_SETEN3(n)                    (1 << (n)) /* Bits 0-15: Bit n sets input interrupt mask of slice n */
                                                      /* Bits 16-31: Reserved */
/* Input bit match interrupt enable */

#define SGPIO_ENABLE3(n)                   (1 << (n)) /* Bits 0-15: Bit n enables input interrupt of slice n */
                                                      /* Bits 16-31: Reserved */
/* Input bit match interrupt status */

#define SGPIO_STATUS3(n)                   (1 << (n)) /* Bits 0-15: Bit n is input interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Input bit match interrupt clear status */

#define SGPIO_CLRSTAT3(n)                  (1 << (n)) /* Bits 0-15: Bit n clears input interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */
/* Input bit match interrupt set status */

#define SGPIO_SETSTAT3(n)                  (1 << (n)) /* Bits 0-15: Bit n sets match interrupt status of slice n */
                                                      /* Bits 16-31: Reserved */

/****************************************************************************************************
 * Public Types
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Data
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC43XX_CHIP_LPC43_SGPIO_H */
